Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMV71_DFP/2.4.171/samv71b/include/component/deprecated/usbhs.h
#define USBHS_FSM_DRDSTATE_A_SUSPEND_Val DEPRECATED(USBHS_FSM_DRDSTATE_A_SUSPEND_Val, "Using deprecated macro USBHS_FSM_DRDSTATE_A_SUSPEND_Val") _U_(0x4) /**< (USBHS_FSM) The A-device operating as a host is in the Suspend mode. */
#define USBHS_FSM_DRDSTATE_A_VBUS_ERR DEPRECATED(USBHS_FSM_DRDSTATE_A_VBUS_ERR, "Using deprecated macro USBHS_FSM_DRDSTATE_A_VBUS_ERR") (USBHS_FSM_DRDSTATE_A_VBUS_ERR_Val << USBHS_FSM_DRDSTATE_Pos) /**< (USBHS_FSM) In this state, the A-device waits for recovery of the over-current condition that caused it to enter this state. Position */
#define USBHS_FSM_DRDSTATE_A_VBUS_ERR_Val DEPRECATED(USBHS_FSM_DRDSTATE_A_VBUS_ERR_Val, "Using deprecated macro USBHS_FSM_DRDSTATE_A_VBUS_ERR_Val") _U_(0x7) /**< (USBHS_FSM) In this state, the A-device waits for recovery of the over-current condition that caused it to enter this state. */
#define USBHS_FSM_DRDSTATE_A_WAIT_BCON DEPRECATED(USBHS_FSM_DRDSTATE_A_WAIT_BCON, "Using deprecated macro USBHS_FSM_DRDSTATE_A_WAIT_BCON") (USBHS_FSM_DRDSTATE_A_WAIT_BCON_Val << USBHS_FSM_DRDSTATE_Pos) /**< (USBHS_FSM) In this state, the A-device waits for the B-device to signal a connection. Position */
#define USBHS_FSM_DRDSTATE_A_WAIT_BCON_Val DEPRECATED(USBHS_FSM_DRDSTATE_A_WAIT_BCON_Val, "Using deprecated macro USBHS_FSM_DRDSTATE_A_WAIT_BCON_Val") _U_(0x2) /**< (USBHS_FSM) In this state, the A-device waits for the B-device to signal a connection. */
#define USBHS_FSM_DRDSTATE_A_WAIT_DISCHARGE DEPRECATED(USBHS_FSM_DRDSTATE_A_WAIT_DISCHARGE, "Using deprecated macro USBHS_FSM_DRDSTATE_A_WAIT_DISCHARGE") (USBHS_FSM_DRDSTATE_A_WAIT_DISCHARGE_Val << USBHS_FSM_DRDSTATE_Pos) /**< (USBHS_FSM) In this state, the A-device waits for the data USB line to discharge (100 us). Position */
#define USBHS_FSM_DRDSTATE_A_WAIT_DISCHARGE_Val DEPRECATED(USBHS_FSM_DRDSTATE_A_WAIT_DISCHARGE_Val, "Using deprecated macro USBHS_FSM_DRDSTATE_A_WAIT_DISCHARGE_Val") _U_(0x8) /**< (USBHS_FSM) In this state, the A-device waits for the data USB line to discharge (100 us). */
#define USBHS_FSM_DRDSTATE_A_WAIT_VFALL DEPRECATED(USBHS_FSM_DRDSTATE_A_WAIT_VFALL, "Using deprecated macro USBHS_FSM_DRDSTATE_A_WAIT_VFALL") (USBHS_FSM_DRDSTATE_A_WAIT_VFALL_Val << USBHS_FSM_DRDSTATE_Pos) /**< (USBHS_FSM) In this state, the A-device waits for the voltage on VBus to drop below the A-device Session Valid threshold (1.4 V). Position */
#define USBHS_FSM_DRDSTATE_A_WAIT_VFALL_Val DEPRECATED(USBHS_FSM_DRDSTATE_A_WAIT_VFALL_Val, "Using deprecated macro USBHS_FSM_DRDSTATE_A_WAIT_VFALL_Val") _U_(0x6) /**< (USBHS_FSM) In this state, the A-device waits for the voltage on VBus to drop below the A-device Session Valid threshold (1.4 V). */
#define USBHS_FSM_DRDSTATE_A_WAIT_VRISE DEPRECATED(USBHS_FSM_DRDSTATE_A_WAIT_VRISE, "Using deprecated macro USBHS_FSM_DRDSTATE_A_WAIT_VRISE") (USBHS_FSM_DRDSTATE_A_WAIT_VRISE_Val << USBHS_FSM_DRDSTATE_Pos) /**< (USBHS_FSM) In this state, the A-device waits for the voltage on VBus to rise above the A-device VBus Valid threshold (4.4 V). Position */
#define USBHS_FSM_DRDSTATE_A_WAIT_VRISE_Val DEPRECATED(USBHS_FSM_DRDSTATE_A_WAIT_VRISE_Val, "Using deprecated macro USBHS_FSM_DRDSTATE_A_WAIT_VRISE_Val") _U_(0x1) /**< (USBHS_FSM) In this state, the A-device waits for the voltage on VBus to rise above the A-device VBus Valid threshold (4.4 V). */
#define USBHS_FSM_DRDSTATE_B_HOST DEPRECATED(USBHS_FSM_DRDSTATE_B_HOST, "Using deprecated macro USBHS_FSM_DRDSTATE_B_HOST") (USBHS_FSM_DRDSTATE_B_HOST_Val << USBHS_FSM_DRDSTATE_Pos) /**< (USBHS_FSM) In this state, the B-device acts as the Host. Position */
#define USBHS_FSM_DRDSTATE_B_HOST_Val DEPRECATED(USBHS_FSM_DRDSTATE_B_HOST_Val, "Using deprecated macro USBHS_FSM_DRDSTATE_B_HOST_Val") _U_(0xE) /**< (USBHS_FSM) In this state, the B-device acts as the Host. */
#define USBHS_FSM_DRDSTATE_B_IDLE DEPRECATED(USBHS_FSM_DRDSTATE_B_IDLE, "Using deprecated macro USBHS_FSM_DRDSTATE_B_IDLE") (USBHS_FSM_DRDSTATE_B_IDLE_Val << USBHS_FSM_DRDSTATE_Pos) /**< (USBHS_FSM) This is the start state for B-device (when the ID pin is 1). Position */
#define USBHS_FSM_DRDSTATE_B_IDLE_Val DEPRECATED(USBHS_FSM_DRDSTATE_B_IDLE_Val, "Using deprecated macro USBHS_FSM_DRDSTATE_B_IDLE_Val") _U_(0x9) /**< (USBHS_FSM) This is the start state for B-device (when the ID pin is 1). */
#define USBHS_FSM_DRDSTATE_B_PERIPHERAL DEPRECATED(USBHS_FSM_DRDSTATE_B_PERIPHERAL, "Using deprecated macro USBHS_FSM_DRDSTATE_B_PERIPHERAL") (USBHS_FSM_DRDSTATE_B_PERIPHERAL_Val << USBHS_FSM_DRDSTATE_Pos) /**< (USBHS_FSM) In this state, the B-device acts as the peripheral. Position */
#define USBHS_FSM_DRDSTATE_B_PERIPHERAL_Val DEPRECATED(USBHS_FSM_DRDSTATE_B_PERIPHERAL_Val, "Using deprecated macro USBHS_FSM_DRDSTATE_B_PERIPHERAL_Val") _U_(0xA) /**< (USBHS_FSM) In this state, the B-device acts as the peripheral. */
#define USBHS_FSM_DRDSTATE_B_SRP_INIT DEPRECATED(USBHS_FSM_DRDSTATE_B_SRP_INIT, "Using deprecated macro USBHS_FSM_DRDSTATE_B_SRP_INIT") (USBHS_FSM_DRDSTATE_B_SRP_INIT_Val << USBHS_FSM_DRDSTATE_Pos) /**< (USBHS_FSM) In this state, the B-device attempts to start a session using the SRP protocol. Position */
#define USBHS_FSM_DRDSTATE_B_SRP_INIT_Val DEPRECATED(USBHS_FSM_DRDSTATE_B_SRP_INIT_Val, "Using deprecated macro USBHS_FSM_DRDSTATE_B_SRP_INIT_Val") _U_(0xF) /**< (USBHS_FSM) In this state, the B-device attempts to start a session using the SRP protocol. */
#define USBHS_FSM_DRDSTATE_B_WAIT_ACON DEPRECATED(USBHS_FSM_DRDSTATE_B_WAIT_ACON, "Using deprecated macro USBHS_FSM_DRDSTATE_B_WAIT_ACON") (USBHS_FSM_DRDSTATE_B_WAIT_ACON_Val << USBHS_FSM_DRDSTATE_Pos) /**< (USBHS_FSM) In this state, the B-device waits for the A-device to signal a connect before becoming B-Host. Position */
#define USBHS_FSM_DRDSTATE_B_WAIT_ACON_Val DEPRECATED(USBHS_FSM_DRDSTATE_B_WAIT_ACON_Val, "Using deprecated macro USBHS_FSM_DRDSTATE_B_WAIT_ACON_Val") _U_(0xD) /**< (USBHS_FSM) In this state, the B-device waits for the A-device to signal a connect before becoming B-Host. */
#define USBHS_FSM_DRDSTATE_B_WAIT_BEGIN_HNP DEPRECATED(USBHS_FSM_DRDSTATE_B_WAIT_BEGIN_HNP, "Using deprecated macro USBHS_FSM_DRDSTATE_B_WAIT_BEGIN_HNP") (USBHS_FSM_DRDSTATE_B_WAIT_BEGIN_HNP_Val << USBHS_FSM_DRDSTATE_Pos) /**< (USBHS_FSM) In this state, the B-device is in Suspend mode and waits until 3 ms before initiating the HNP protocol if requested. Position */
#define USBHS_FSM_DRDSTATE_B_WAIT_BEGIN_HNP_Val DEPRECATED(USBHS_FSM_DRDSTATE_B_WAIT_BEGIN_HNP_Val, "Using deprecated macro USBHS_FSM_DRDSTATE_B_WAIT_BEGIN_HNP_Val") _U_(0xB) /**< (USBHS_FSM) In this state, the B-device is in Suspend mode and waits until 3 ms before initiating the HNP protocol if requested. */
#define USBHS_FSM_DRDSTATE_B_WAIT_DISCHARGE DEPRECATED(USBHS_FSM_DRDSTATE_B_WAIT_DISCHARGE, "Using deprecated macro USBHS_FSM_DRDSTATE_B_WAIT_DISCHARGE") (USBHS_FSM_DRDSTATE_B_WAIT_DISCHARGE_Val << USBHS_FSM_DRDSTATE_Pos) /**< (USBHS_FSM) In this state, the B-device waits for the data USB line to discharge (100 us)) before becoming Host. Position */
#define USBHS_FSM_DRDSTATE_B_WAIT_DISCHARGE_Val DEPRECATED(USBHS_FSM_DRDSTATE_B_WAIT_DISCHARGE_Val, "Using deprecated macro USBHS_FSM_DRDSTATE_B_WAIT_DISCHARGE_Val") _U_(0xC) /**< (USBHS_FSM) In this state, the B-device waits for the data USB line to discharge (100 us)) before becoming Host. */
#define USBHS_FSM_DRDSTATE_Msk DEPRECATED(USBHS_FSM_DRDSTATE_Msk, "Using deprecated macro USBHS_FSM_DRDSTATE_Msk") (_U_(0xF) << USBHS_FSM_DRDSTATE_Pos) /**< (USBHS_FSM) Dual Role Device State Mask */
#define USBHS_FSM_DRDSTATE_Pos DEPRECATED(USBHS_FSM_DRDSTATE_Pos, "Using deprecated macro USBHS_FSM_DRDSTATE_Pos") 0 /**< (USBHS_FSM) Dual Role Device State Position */
#define USBHS_FSM_DRDSTATE(value) DEPRECATED(USBHS_FSM_DRDSTATE, "Using deprecated macro USBHS_FSM_DRDSTATE") (USBHS_FSM_DRDSTATE_Msk & ((value) << USBHS_FSM_DRDSTATE_Pos))
#define USBHS_FSM_MASK DEPRECATED(USBHS_FSM_MASK, "Using deprecated macro USBHS_FSM_MASK") _U_(0x0F) /**< \deprecated (USBHS_FSM) Register MASK (Use USBHS_FSM_Msk instead) */
#define USBHS_FSM_Msk DEPRECATED(USBHS_FSM_Msk, "Using deprecated macro USBHS_FSM_Msk") _U_(0x0F) /**< (USBHS_FSM) Register Mask */
#define USBHS_FSM_OFFSET DEPRECATED(USBHS_FSM_OFFSET, "Using deprecated macro USBHS_FSM_OFFSET") (0x82C) /**< (USBHS_FSM) General Finite State Machine Register Offset */
#define USBHS_HSTIDR_DMA_7_Msk DEPRECATED(USBHS_HSTIDR_DMA_7_Msk, "Using deprecated macro USBHS_HSTIDR_DMA_7_Msk") (_U_(0x1) << USBHS_HSTIDR_DMA_7_Pos) /**< (USBHS_HSTIDR) DMA Channel 7 Interrupt Disable Mask */
#define USBHS_HSTIDR_DMA_7_Pos DEPRECATED(USBHS_HSTIDR_DMA_7_Pos, "Using deprecated macro USBHS_HSTIDR_DMA_7_Pos") 31 /**< (USBHS_HSTIDR) DMA Channel 7 Interrupt Disable Position */
#define USBHS_HSTIDR_DMA_7 DEPRECATED(USBHS_HSTIDR_DMA_7, "Using deprecated macro USBHS_HSTIDR_DMA_7") USBHS_HSTIDR_DMA_7_Msk /**< \deprecated Old style mask definition for 1 bit bitfield. Use USBHS_HSTIDR_DMA_7_Msk instead */
#define USBHS_HSTIER_DMA_7_Msk DEPRECATED(USBHS_HSTIER_DMA_7_Msk, "Using deprecated macro USBHS_HSTIER_DMA_7_Msk") (_U_(0x1) << USBHS_HSTIER_DMA_7_Pos) /**< (USBHS_HSTIER) DMA Channel 7 Interrupt Enable Mask */
#define USBHS_HSTIER_DMA_7_Pos DEPRECATED(USBHS_HSTIER_DMA_7_Pos, "Using deprecated macro USBHS_HSTIER_DMA_7_Pos") 31 /**< (USBHS_HSTIER) DMA Channel 7 Interrupt Enable Position */
#define USBHS_HSTIER_DMA_7 DEPRECATED(USBHS_HSTIER_DMA_7, "Using deprecated macro USBHS_HSTIER_DMA_7") USBHS_HSTIER_DMA_7_Msk /**< \deprecated Old style mask definition for 1 bit bitfield. Use USBHS_HSTIER_DMA_7_Msk instead */
#define USBHS_HSTIFR_DMA_7_Msk DEPRECATED(USBHS_HSTIFR_DMA_7_Msk, "Using deprecated macro USBHS_HSTIFR_DMA_7_Msk") (_U_(0x1) << USBHS_HSTIFR_DMA_7_Pos) /**< (USBHS_HSTIFR) DMA Channel 7 Interrupt Set Mask */
#define USBHS_HSTIFR_DMA_7_Pos DEPRECATED(USBHS_HSTIFR_DMA_7_Pos, "Using deprecated macro USBHS_HSTIFR_DMA_7_Pos") 31 /**< (USBHS_HSTIFR) DMA Channel 7 Interrupt Set Position */
#define USBHS_HSTIFR_DMA_7 DEPRECATED(USBHS_HSTIFR_DMA_7, "Using deprecated macro USBHS_HSTIFR_DMA_7") USBHS_HSTIFR_DMA_7_Msk /**< \deprecated Old style mask definition for 1 bit bitfield. Use USBHS_HSTIFR_DMA_7_Msk instead */
#define USBHS_HSTIMR_DMA_7_Msk DEPRECATED(USBHS_HSTIMR_DMA_7_Msk, "Using deprecated macro USBHS_HSTIMR_DMA_7_Msk") (_U_(0x1) << USBHS_HSTIMR_DMA_7_Pos) /**< (USBHS_HSTIMR) DMA Channel 7 Interrupt Enable Mask */
#define USBHS_HSTIMR_DMA_7_Pos DEPRECATED(USBHS_HSTIMR_DMA_7_Pos, "Using deprecated macro USBHS_HSTIMR_DMA_7_Pos") 31 /**< (USBHS_HSTIMR) DMA Channel 7 Interrupt Enable Position */
#define USBHS_HSTIMR_DMA_7 DEPRECATED(USBHS_HSTIMR_DMA_7, "Using deprecated macro USBHS_HSTIMR_DMA_7") USBHS_HSTIMR_DMA_7_Msk /**< \deprecated Old style mask definition for 1 bit bitfield. Use USBHS_HSTIMR_DMA_7_Msk instead */
#define USBHS_HSTISR_DMA_7_Msk DEPRECATED(USBHS_HSTISR_DMA_7_Msk, "Using deprecated macro USBHS_HSTISR_DMA_7_Msk") (_U_(0x1) << USBHS_HSTISR_DMA_7_Pos) /**< (USBHS_HSTISR) DMA Channel 7 Interrupt Mask */
#define USBHS_HSTISR_DMA_7_Pos DEPRECATED(USBHS_HSTISR_DMA_7_Pos, "Using deprecated macro USBHS_HSTISR_DMA_7_Pos") 31 /**< (USBHS_HSTISR) DMA Channel 7 Interrupt Position */
#define USBHS_HSTISR_DMA_7 DEPRECATED(USBHS_HSTISR_DMA_7, "Using deprecated macro USBHS_HSTISR_DMA_7") USBHS_HSTISR_DMA_7_Msk /**< \deprecated Old style mask definition for 1 bit bitfield. Use USBHS_HSTISR_DMA_7_Msk instead */
#define USBHS_HSTPIPICR_RXSTALLDIC_Msk DEPRECATED(USBHS_HSTPIPICR_RXSTALLDIC_Msk, "Using deprecated macro USBHS_HSTPIPICR_RXSTALLDIC_Msk") (_U_(0x1) << USBHS_HSTPIPICR_RXSTALLDIC_Pos) /**< (USBHS_HSTPIPICR) Received STALLed Interrupt Clear Mask */
#define USBHS_HSTPIPICR_RXSTALLDIC_Pos DEPRECATED(USBHS_HSTPIPICR_RXSTALLDIC_Pos, "Using deprecated macro USBHS_HSTPIPICR_RXSTALLDIC_Pos") 6 /**< (USBHS_HSTPIPICR) Received STALLed Interrupt Clear Position */
#define USBHS_HSTPIPICR_RXSTALLDIC DEPRECATED(USBHS_HSTPIPICR_RXSTALLDIC, "Using deprecated macro USBHS_HSTPIPICR_RXSTALLDIC") USBHS_HSTPIPICR_RXSTALLDIC_Msk /**< \deprecated Old style mask definition for 1 bit bitfield. Use USBHS_HSTPIPICR_RXSTALLDIC_Msk instead */
#define USBHS_HSTPIPICR_TXSTPIC_Msk DEPRECATED(USBHS_HSTPIPICR_TXSTPIC_Msk, "Using deprecated macro USBHS_HSTPIPICR_TXSTPIC_Msk") (_U_(0x1) << USBHS_HSTPIPICR_TXSTPIC_Pos) /**< (USBHS_HSTPIPICR) Transmitted SETUP Interrupt Clear Mask */
#define USBHS_HSTPIPICR_TXSTPIC_Pos DEPRECATED(USBHS_HSTPIPICR_TXSTPIC_Pos, "Using deprecated macro USBHS_HSTPIPICR_TXSTPIC_Pos") 2 /**< (USBHS_HSTPIPICR) Transmitted SETUP Interrupt Clear Position */
#define USBHS_HSTPIPICR_TXSTPIC DEPRECATED(USBHS_HSTPIPICR_TXSTPIC, "Using deprecated macro USBHS_HSTPIPICR_TXSTPIC") USBHS_HSTPIPICR_TXSTPIC_Msk /**< \deprecated Old style mask definition for 1 bit bitfield. Use USBHS_HSTPIPICR_TXSTPIC_Msk instead */
#define USBHS_HSTPIPIDR_RXSTALLDEC_Msk DEPRECATED(USBHS_HSTPIPIDR_RXSTALLDEC_Msk, "Using deprecated macro USBHS_HSTPIPIDR_RXSTALLDEC_Msk") (_U_(0x1) << USBHS_HSTPIPIDR_RXSTALLDEC_Pos) /**< (USBHS_HSTPIPIDR) Received STALLed Interrupt Disable Mask */
#define USBHS_HSTPIPIDR_RXSTALLDEC_Pos DEPRECATED(USBHS_HSTPIPIDR_RXSTALLDEC_Pos, "Using deprecated macro USBHS_HSTPIPIDR_RXSTALLDEC_Pos") 6 /**< (USBHS_HSTPIPIDR) Received STALLed Interrupt Disable Position */
#define USBHS_HSTPIPIDR_RXSTALLDEC DEPRECATED(USBHS_HSTPIPIDR_RXSTALLDEC, "Using deprecated macro USBHS_HSTPIPIDR_RXSTALLDEC") USBHS_HSTPIPIDR_RXSTALLDEC_Msk /**< \deprecated Old style mask definition for 1 bit bitfield. Use USBHS_HSTPIPIDR_RXSTALLDEC_Msk instead */
#define USBHS_HSTPIPIDR_TXSTPEC_Msk DEPRECATED(USBHS_HSTPIPIDR_TXSTPEC_Msk, "Using deprecated macro USBHS_HSTPIPIDR_TXSTPEC_Msk") (_U_(0x1) << USBHS_HSTPIPIDR_TXSTPEC_Pos) /**< (USBHS_HSTPIPIDR) Transmitted SETUP Interrupt Disable Mask */
#define USBHS_HSTPIPIDR_TXSTPEC_Pos DEPRECATED(USBHS_HSTPIPIDR_TXSTPEC_Pos, "Using deprecated macro USBHS_HSTPIPIDR_TXSTPEC_Pos") 2 /**< (USBHS_HSTPIPIDR) Transmitted SETUP Interrupt Disable Position */
#define USBHS_HSTPIPIDR_TXSTPEC DEPRECATED(USBHS_HSTPIPIDR_TXSTPEC, "Using deprecated macro USBHS_HSTPIPIDR_TXSTPEC") USBHS_HSTPIPIDR_TXSTPEC_Msk /**< \deprecated Old style mask definition for 1 bit bitfield. Use USBHS_HSTPIPIDR_TXSTPEC_Msk instead */
#define USBHS_HSTPIPIER_RXSTALLDES_Msk DEPRECATED(USBHS_HSTPIPIER_RXSTALLDES_Msk, "Using deprecated macro USBHS_HSTPIPIER_RXSTALLDES_Msk") (_U_(0x1) << USBHS_HSTPIPIER_RXSTALLDES_Pos) /**< (USBHS_HSTPIPIER) Received STALLed Interrupt Enable Mask */
#define USBHS_HSTPIPIER_RXSTALLDES_Pos DEPRECATED(USBHS_HSTPIPIER_RXSTALLDES_Pos, "Using deprecated macro USBHS_HSTPIPIER_RXSTALLDES_Pos") 6 /**< (USBHS_HSTPIPIER) Received STALLed Interrupt Enable Position */
#define USBHS_HSTPIPIER_RXSTALLDES DEPRECATED(USBHS_HSTPIPIER_RXSTALLDES, "Using deprecated macro USBHS_HSTPIPIER_RXSTALLDES") USBHS_HSTPIPIER_RXSTALLDES_Msk /**< \deprecated Old style mask definition for 1 bit bitfield. Use USBHS_HSTPIPIER_RXSTALLDES_Msk instead */
#define USBHS_HSTPIPIER_TXSTPES_Msk DEPRECATED(USBHS_HSTPIPIER_TXSTPES_Msk, "Using deprecated macro USBHS_HSTPIPIER_TXSTPES_Msk") (_U_(0x1) << USBHS_HSTPIPIER_TXSTPES_Pos) /**< (USBHS_HSTPIPIER) Transmitted SETUP Interrupt Enable Mask */
#define USBHS_HSTPIPIER_TXSTPES_Pos DEPRECATED(USBHS_HSTPIPIER_TXSTPES_Pos, "Using deprecated macro USBHS_HSTPIPIER_TXSTPES_Pos") 2 /**< (USBHS_HSTPIPIER) Transmitted SETUP Interrupt Enable Position */
#define USBHS_HSTPIPIER_TXSTPES DEPRECATED(USBHS_HSTPIPIER_TXSTPES, "Using deprecated macro USBHS_HSTPIPIER_TXSTPES") USBHS_HSTPIPIER_TXSTPES_Msk /**< \deprecated Old style mask definition for 1 bit bitfield. Use USBHS_HSTPIPIER_TXSTPES_Msk instead */
#define USBHS_HSTPIPIFR_RXSTALLDIS_Msk DEPRECATED(USBHS_HSTPIPIFR_RXSTALLDIS_Msk, "Using deprecated macro USBHS_HSTPIPIFR_RXSTALLDIS_Msk") (_U_(0x1) << USBHS_HSTPIPIFR_RXSTALLDIS_Pos) /**< (USBHS_HSTPIPIFR) Received STALLed Interrupt Set Mask */
#define USBHS_HSTPIPIFR_RXSTALLDIS_Pos DEPRECATED(USBHS_HSTPIPIFR_RXSTALLDIS_Pos, "Using deprecated macro USBHS_HSTPIPIFR_RXSTALLDIS_Pos") 6 /**< (USBHS_HSTPIPIFR) Received STALLed Interrupt Set Position */
#define USBHS_HSTPIPIFR_RXSTALLDIS DEPRECATED(USBHS_HSTPIPIFR_RXSTALLDIS, "Using deprecated macro USBHS_HSTPIPIFR_RXSTALLDIS") USBHS_HSTPIPIFR_RXSTALLDIS_Msk /**< \deprecated Old style mask definition for 1 bit bitfield. Use USBHS_HSTPIPIFR_RXSTALLDIS_Msk instead */
#define USBHS_HSTPIPIFR_TXSTPIS_Msk DEPRECATED(USBHS_HSTPIPIFR_TXSTPIS_Msk, "Using deprecated macro USBHS_HSTPIPIFR_TXSTPIS_Msk") (_U_(0x1) << USBHS_HSTPIPIFR_TXSTPIS_Pos) /**< (USBHS_HSTPIPIFR) Transmitted SETUP Interrupt Set Mask */
#define USBHS_HSTPIPIFR_TXSTPIS_Pos DEPRECATED(USBHS_HSTPIPIFR_TXSTPIS_Pos, "Using deprecated macro USBHS_HSTPIPIFR_TXSTPIS_Pos") 2 /**< (USBHS_HSTPIPIFR) Transmitted SETUP Interrupt Set Position */
#define USBHS_HSTPIPIFR_TXSTPIS DEPRECATED(USBHS_HSTPIPIFR_TXSTPIS, "Using deprecated macro USBHS_HSTPIPIFR_TXSTPIS") USBHS_HSTPIPIFR_TXSTPIS_Msk /**< \deprecated Old style mask definition for 1 bit bitfield. Use USBHS_HSTPIPIFR_TXSTPIS_Msk instead */
#define USBHS_HSTPIPIMR_RXSTALLDE_Msk DEPRECATED(USBHS_HSTPIPIMR_RXSTALLDE_Msk, "Using deprecated macro USBHS_HSTPIPIMR_RXSTALLDE_Msk") (_U_(0x1) << USBHS_HSTPIPIMR_RXSTALLDE_Pos) /**< (USBHS_HSTPIPIMR) Received STALLed Interrupt Enable Mask */
#define USBHS_HSTPIPIMR_RXSTALLDE_Pos DEPRECATED(USBHS_HSTPIPIMR_RXSTALLDE_Pos, "Using deprecated macro USBHS_HSTPIPIMR_RXSTALLDE_Pos") 6 /**< (USBHS_HSTPIPIMR) Received STALLed Interrupt Enable Position */
#define USBHS_HSTPIPIMR_RXSTALLDE DEPRECATED(USBHS_HSTPIPIMR_RXSTALLDE, "Using deprecated macro USBHS_HSTPIPIMR_RXSTALLDE") USBHS_HSTPIPIMR_RXSTALLDE_Msk /**< \deprecated Old style mask definition for 1 bit bitfield. Use USBHS_HSTPIPIMR_RXSTALLDE_Msk instead */
#define USBHS_HSTPIPIMR_TXSTPE_Msk DEPRECATED(USBHS_HSTPIPIMR_TXSTPE_Msk, "Using deprecated macro USBHS_HSTPIPIMR_TXSTPE_Msk") (_U_(0x1) << USBHS_HSTPIPIMR_TXSTPE_Pos) /**< (USBHS_HSTPIPIMR) Transmitted SETUP Interrupt Enable Mask */
#define USBHS_HSTPIPIMR_TXSTPE_Pos DEPRECATED(USBHS_HSTPIPIMR_TXSTPE_Pos, "Using deprecated macro USBHS_HSTPIPIMR_TXSTPE_Pos") 2 /**< (USBHS_HSTPIPIMR) Transmitted SETUP Interrupt Enable Position */
#define USBHS_HSTPIPIMR_TXSTPE DEPRECATED(USBHS_HSTPIPIMR_TXSTPE, "Using deprecated macro USBHS_HSTPIPIMR_TXSTPE") USBHS_HSTPIPIMR_TXSTPE_Msk /**< \deprecated Old style mask definition for 1 bit bitfield. Use USBHS_HSTPIPIMR_TXSTPE_Msk instead */
#define USBHS_HSTPIPISR_RXSTALLDI_Msk DEPRECATED(USBHS_HSTPIPISR_RXSTALLDI_Msk, "Using deprecated macro USBHS_HSTPIPISR_RXSTALLDI_Msk") (_U_(0x1) << USBHS_HSTPIPISR_RXSTALLDI_Pos) /**< (USBHS_HSTPIPISR) Received STALLed Interrupt Mask */
#define USBHS_HSTPIPISR_RXSTALLDI_Pos DEPRECATED(USBHS_HSTPIPISR_RXSTALLDI_Pos, "Using deprecated macro USBHS_HSTPIPISR_RXSTALLDI_Pos") 6 /**< (USBHS_HSTPIPISR) Received STALLed Interrupt Position */
#define USBHS_HSTPIPISR_RXSTALLDI DEPRECATED(USBHS_HSTPIPISR_RXSTALLDI, "Using deprecated macro USBHS_HSTPIPISR_RXSTALLDI") USBHS_HSTPIPISR_RXSTALLDI_Msk /**< \deprecated Old style mask definition for 1 bit bitfield. Use USBHS_HSTPIPISR_RXSTALLDI_Msk instead */
#define USBHS_HSTPIPISR_TXSTPI_Msk DEPRECATED(USBHS_HSTPIPISR_TXSTPI_Msk, "Using deprecated macro USBHS_HSTPIPISR_TXSTPI_Msk") (_U_(0x1) << USBHS_HSTPIPISR_TXSTPI_Pos) /**< (USBHS_HSTPIPISR) Transmitted SETUP Interrupt Mask */
#define USBHS_HSTPIPISR_TXSTPI_Pos DEPRECATED(USBHS_HSTPIPISR_TXSTPI_Pos, "Using deprecated macro USBHS_HSTPIPISR_TXSTPI_Pos") 2 /**< (USBHS_HSTPIPISR) Transmitted SETUP Interrupt Position */
#define USBHS_HSTPIPISR_TXSTPI DEPRECATED(USBHS_HSTPIPISR_TXSTPI, "Using deprecated macro USBHS_HSTPIPISR_TXSTPI") USBHS_HSTPIPISR_TXSTPI_Msk /**< \deprecated Old style mask definition for 1 bit bitfield. Use USBHS_HSTPIPISR_TXSTPI_Msk instead */
#define USBHS_TSTA1_CounterA_Msk DEPRECATED(USBHS_TSTA1_CounterA_Msk, "Using deprecated macro USBHS_TSTA1_CounterA_Msk") (_U_(0x7FFF) << USBHS_TSTA1_CounterA_Pos) /**< (USBHS_TSTA1) Counter A Mask */
#define USBHS_TSTA1_CounterA_Pos DEPRECATED(USBHS_TSTA1_CounterA_Pos, "Using deprecated macro USBHS_TSTA1_CounterA_Pos") 0 /**< (USBHS_TSTA1) Counter A Position */
#define USBHS_TSTA1_CounterA(value) DEPRECATED(USBHS_TSTA1_CounterA, "Using deprecated macro USBHS_TSTA1_CounterA") (USBHS_TSTA1_CounterA_Msk & ((value) << USBHS_TSTA1_CounterA_Pos))
#define USBHS_TSTA1_CounterB_Msk DEPRECATED(USBHS_TSTA1_CounterB_Msk, "Using deprecated macro USBHS_TSTA1_CounterB_Msk") (_U_(0x3F) << USBHS_TSTA1_CounterB_Pos) /**< (USBHS_TSTA1) Counter B Mask */
#define USBHS_TSTA1_CounterB_Pos DEPRECATED(USBHS_TSTA1_CounterB_Pos, "Using deprecated macro USBHS_TSTA1_CounterB_Pos") 16 /**< (USBHS_TSTA1) Counter B Position */
#define USBHS_TSTA1_CounterB(value) DEPRECATED(USBHS_TSTA1_CounterB, "Using deprecated macro USBHS_TSTA1_CounterB") (USBHS_TSTA1_CounterB_Msk & ((value) << USBHS_TSTA1_CounterB_Pos))
#define USBHS_TSTA1_LoadCntA_Msk DEPRECATED(USBHS_TSTA1_LoadCntA_Msk, "Using deprecated macro USBHS_TSTA1_LoadCntA_Msk") (_U_(0x1) << USBHS_TSTA1_LoadCntA_Pos) /**< (USBHS_TSTA1) Load CounterA Mask */
#define USBHS_TSTA1_LoadCntA_Pos DEPRECATED(USBHS_TSTA1_LoadCntA_Pos, "Using deprecated macro USBHS_TSTA1_LoadCntA_Pos") 15 /**< (USBHS_TSTA1) Load CounterA Position */
#define USBHS_TSTA1_LoadCntA DEPRECATED(USBHS_TSTA1_LoadCntA, "Using deprecated macro USBHS_TSTA1_LoadCntA") USBHS_TSTA1_LoadCntA_Msk /**< \deprecated Old style mask definition for 1 bit bitfield. Use USBHS_TSTA1_LoadCntA_Msk instead */
#define USBHS_TSTA1_LoadCntB_Msk DEPRECATED(USBHS_TSTA1_LoadCntB_Msk, "Using deprecated macro USBHS_TSTA1_LoadCntB_Msk") (_U_(0x1) << USBHS_TSTA1_LoadCntB_Pos) /**< (USBHS_TSTA1) Load CounterB Mask */
#define USBHS_TSTA1_LoadCntB_Pos DEPRECATED(USBHS_TSTA1_LoadCntB_Pos, "Using deprecated macro USBHS_TSTA1_LoadCntB_Pos") 23 /**< (USBHS_TSTA1) Load CounterB Position */
#define USBHS_TSTA1_LoadCntB DEPRECATED(USBHS_TSTA1_LoadCntB, "Using deprecated macro USBHS_TSTA1_LoadCntB") USBHS_TSTA1_LoadCntB_Msk /**< \deprecated Old style mask definition for 1 bit bitfield. Use USBHS_TSTA1_LoadCntB_Msk instead */
#define USBHS_TSTA1_LoadSOFCnt_Msk DEPRECATED(USBHS_TSTA1_LoadSOFCnt_Msk, "Using deprecated macro USBHS_TSTA1_LoadSOFCnt_Msk") (_U_(0x1) << USBHS_TSTA1_LoadSOFCnt_Pos) /**< (USBHS_TSTA1) Load SOF Counter Mask */
#define USBHS_TSTA1_LoadSOFCnt_Pos DEPRECATED(USBHS_TSTA1_LoadSOFCnt_Pos, "Using deprecated macro USBHS_TSTA1_LoadSOFCnt_Pos") 31 /**< (USBHS_TSTA1) Load SOF Counter Position */
#define USBHS_TSTA1_LoadSOFCnt DEPRECATED(USBHS_TSTA1_LoadSOFCnt, "Using deprecated macro USBHS_TSTA1_LoadSOFCnt") USBHS_TSTA1_LoadSOFCnt_Msk /**< \deprecated Old style mask definition for 1 bit bitfield. Use USBHS_TSTA1_LoadSOFCnt_Msk instead */
#define USBHS_TSTA1_MASK DEPRECATED(USBHS_TSTA1_MASK, "Using deprecated macro USBHS_TSTA1_MASK") _U_(0xFFBFFFFF) /**< \deprecated (USBHS_TSTA1) Register MASK (Use USBHS_TSTA1_Msk instead) */
#define USBHS_TSTA1_Msk DEPRECATED(USBHS_TSTA1_Msk, "Using deprecated macro USBHS_TSTA1_Msk") _U_(0xFFBFFFFF) /**< (USBHS_TSTA1) Register Mask */
#define USBHS_TSTA1_OFFSET DEPRECATED(USBHS_TSTA1_OFFSET, "Using deprecated macro USBHS_TSTA1_OFFSET") (0x810) /**< (USBHS_TSTA1) General Test A1 Register Offset */
#define USBHS_TSTA1_SOFCntMa1_Msk DEPRECATED(USBHS_TSTA1_SOFCntMa1_Msk, "Using deprecated macro USBHS_TSTA1_SOFCntMa1_Msk") (_U_(0x7F) << USBHS_TSTA1_SOFCntMa1_Pos) /**< (USBHS_TSTA1) SOF Counter Max Mask */
#define USBHS_TSTA1_SOFCntMa1_Pos DEPRECATED(USBHS_TSTA1_SOFCntMa1_Pos, "Using deprecated macro USBHS_TSTA1_SOFCntMa1_Pos") 24 /**< (USBHS_TSTA1) SOF Counter Max Position */
#define USBHS_TSTA1_SOFCntMa1(value) DEPRECATED(USBHS_TSTA1_SOFCntMa1, "Using deprecated macro USBHS_TSTA1_SOFCntMa1") (USBHS_TSTA1_SOFCntMa1_Msk & ((value) << USBHS_TSTA1_SOFCntMa1_Pos))
