Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMV71_DFP/2.4.171/samv71b/include/component/deprecated/usbhs.h
#define USBHS_TSTA2_ByPassDpll_Msk DEPRECATED(USBHS_TSTA2_ByPassDpll_Msk, "Using deprecated macro USBHS_TSTA2_ByPassDpll_Msk") (_U_(0x1) << USBHS_TSTA2_ByPassDpll_Pos) /**< (USBHS_TSTA2) Bypass DPLL Mask */
#define USBHS_TSTA2_ByPassDpll_Pos DEPRECATED(USBHS_TSTA2_ByPassDpll_Pos, "Using deprecated macro USBHS_TSTA2_ByPassDpll_Pos") 5 /**< (USBHS_TSTA2) Bypass DPLL Position */
#define USBHS_TSTA2_ByPassDpll DEPRECATED(USBHS_TSTA2_ByPassDpll, "Using deprecated macro USBHS_TSTA2_ByPassDpll") USBHS_TSTA2_ByPassDpll_Msk /**< \deprecated Old style mask definition for 1 bit bitfield. Use USBHS_TSTA2_ByPassDpll_Msk instead */
#define USBHS_TSTA2_DisableGatedClock_Msk DEPRECATED(USBHS_TSTA2_DisableGatedClock_Msk, "Using deprecated macro USBHS_TSTA2_DisableGatedClock_Msk") (_U_(0x1) << USBHS_TSTA2_DisableGatedClock_Pos) /**< (USBHS_TSTA2) Disable Gated Clock Mask */
#define USBHS_TSTA2_DisableGatedClock_Pos DEPRECATED(USBHS_TSTA2_DisableGatedClock_Pos, "Using deprecated macro USBHS_TSTA2_DisableGatedClock_Pos") 3 /**< (USBHS_TSTA2) Disable Gated Clock Position */
#define USBHS_TSTA2_DisableGatedClock DEPRECATED(USBHS_TSTA2_DisableGatedClock, "Using deprecated macro USBHS_TSTA2_DisableGatedClock") USBHS_TSTA2_DisableGatedClock_Msk /**< \deprecated Old style mask definition for 1 bit bitfield. Use USBHS_TSTA2_DisableGatedClock_Msk instead */
#define USBHS_TSTA2_ForceHSRst_50ms_Msk DEPRECATED(USBHS_TSTA2_ForceHSRst_50ms_Msk, "Using deprecated macro USBHS_TSTA2_ForceHSRst_50ms_Msk") (_U_(0x1) << USBHS_TSTA2_ForceHSRst_50ms_Pos) /**< (USBHS_TSTA2) Force HS Reset to 50 ms Mask */
#define USBHS_TSTA2_ForceHSRst_50ms_Pos DEPRECATED(USBHS_TSTA2_ForceHSRst_50ms_Pos, "Using deprecated macro USBHS_TSTA2_ForceHSRst_50ms_Pos") 7 /**< (USBHS_TSTA2) Force HS Reset to 50 ms Position */
#define USBHS_TSTA2_ForceHSRst_50ms DEPRECATED(USBHS_TSTA2_ForceHSRst_50ms, "Using deprecated macro USBHS_TSTA2_ForceHSRst_50ms") USBHS_TSTA2_ForceHSRst_50ms_Msk /**< \deprecated Old style mask definition for 1 bit bitfield. Use USBHS_TSTA2_ForceHSRst_50ms_Msk instead */
#define USBHS_TSTA2_ForceSuspendMTo1_Msk DEPRECATED(USBHS_TSTA2_ForceSuspendMTo1_Msk, "Using deprecated macro USBHS_TSTA2_ForceSuspendMTo1_Msk") (_U_(0x1) << USBHS_TSTA2_ForceSuspendMTo1_Pos) /**< (USBHS_TSTA2) Force SuspendM to 1 Mask */
#define USBHS_TSTA2_ForceSuspendMTo1_Pos DEPRECATED(USBHS_TSTA2_ForceSuspendMTo1_Pos, "Using deprecated macro USBHS_TSTA2_ForceSuspendMTo1_Pos") 4 /**< (USBHS_TSTA2) Force SuspendM to 1 Position */
#define USBHS_TSTA2_ForceSuspendMTo1 DEPRECATED(USBHS_TSTA2_ForceSuspendMTo1, "Using deprecated macro USBHS_TSTA2_ForceSuspendMTo1") USBHS_TSTA2_ForceSuspendMTo1_Msk /**< \deprecated Old style mask definition for 1 bit bitfield. Use USBHS_TSTA2_ForceSuspendMTo1_Msk instead */
#define USBHS_TSTA2_FullDetachEn_Msk DEPRECATED(USBHS_TSTA2_FullDetachEn_Msk, "Using deprecated macro USBHS_TSTA2_FullDetachEn_Msk") (_U_(0x1) << USBHS_TSTA2_FullDetachEn_Pos) /**< (USBHS_TSTA2) Full Detach Enable Mask */
#define USBHS_TSTA2_FullDetachEn_Pos DEPRECATED(USBHS_TSTA2_FullDetachEn_Pos, "Using deprecated macro USBHS_TSTA2_FullDetachEn_Pos") 0 /**< (USBHS_TSTA2) Full Detach Enable Position */
#define USBHS_TSTA2_FullDetachEn DEPRECATED(USBHS_TSTA2_FullDetachEn, "Using deprecated macro USBHS_TSTA2_FullDetachEn") USBHS_TSTA2_FullDetachEn_Msk /**< \deprecated Old style mask definition for 1 bit bitfield. Use USBHS_TSTA2_FullDetachEn_Msk instead */
#define USBHS_TSTA2_HostHSDisconnectDisable_Msk DEPRECATED(USBHS_TSTA2_HostHSDisconnectDisable_Msk, "Using deprecated macro USBHS_TSTA2_HostHSDisconnectDisable_Msk") (_U_(0x1) << USBHS_TSTA2_HostHSDisconnectDisable_Pos) /**< (USBHS_TSTA2) Host HS Disconnect Disable Mask */
#define USBHS_TSTA2_HostHSDisconnectDisable_Pos DEPRECATED(USBHS_TSTA2_HostHSDisconnectDisable_Pos, "Using deprecated macro USBHS_TSTA2_HostHSDisconnectDisable_Pos") 6 /**< (USBHS_TSTA2) Host HS Disconnect Disable Position */
#define USBHS_TSTA2_HostHSDisconnectDisable DEPRECATED(USBHS_TSTA2_HostHSDisconnectDisable, "Using deprecated macro USBHS_TSTA2_HostHSDisconnectDisable") USBHS_TSTA2_HostHSDisconnectDisable_Msk /**< \deprecated Old style mask definition for 1 bit bitfield. Use USBHS_TSTA2_HostHSDisconnectDisable_Msk instead */
#define USBHS_TSTA2_HSSerialMode_Msk DEPRECATED(USBHS_TSTA2_HSSerialMode_Msk, "Using deprecated macro USBHS_TSTA2_HSSerialMode_Msk") (_U_(0x1) << USBHS_TSTA2_HSSerialMode_Pos) /**< (USBHS_TSTA2) HS Serial Mode Mask */
#define USBHS_TSTA2_HSSerialMode_Pos DEPRECATED(USBHS_TSTA2_HSSerialMode_Pos, "Using deprecated macro USBHS_TSTA2_HSSerialMode_Pos") 1 /**< (USBHS_TSTA2) HS Serial Mode Position */
#define USBHS_TSTA2_HSSerialMode DEPRECATED(USBHS_TSTA2_HSSerialMode, "Using deprecated macro USBHS_TSTA2_HSSerialMode") USBHS_TSTA2_HSSerialMode_Msk /**< \deprecated Old style mask definition for 1 bit bitfield. Use USBHS_TSTA2_HSSerialMode_Msk instead */
#define USBHS_TSTA2_LoopBackMode_Msk DEPRECATED(USBHS_TSTA2_LoopBackMode_Msk, "Using deprecated macro USBHS_TSTA2_LoopBackMode_Msk") (_U_(0x1) << USBHS_TSTA2_LoopBackMode_Pos) /**< (USBHS_TSTA2) Loop-back Mode Mask */
#define USBHS_TSTA2_LoopBackMode_Pos DEPRECATED(USBHS_TSTA2_LoopBackMode_Pos, "Using deprecated macro USBHS_TSTA2_LoopBackMode_Pos") 2 /**< (USBHS_TSTA2) Loop-back Mode Position */
#define USBHS_TSTA2_LoopBackMode DEPRECATED(USBHS_TSTA2_LoopBackMode, "Using deprecated macro USBHS_TSTA2_LoopBackMode") USBHS_TSTA2_LoopBackMode_Msk /**< \deprecated Old style mask definition for 1 bit bitfield. Use USBHS_TSTA2_LoopBackMode_Msk instead */
#define USBHS_TSTA2_MASK DEPRECATED(USBHS_TSTA2_MASK, "Using deprecated macro USBHS_TSTA2_MASK") _U_(0x2FF) /**< \deprecated (USBHS_TSTA2) Register MASK (Use USBHS_TSTA2_Msk instead) */
#define USBHS_TSTA2_Msk DEPRECATED(USBHS_TSTA2_Msk, "Using deprecated macro USBHS_TSTA2_Msk") _U_(0x2FF) /**< (USBHS_TSTA2) Register Mask */
#define USBHS_TSTA2_OFFSET DEPRECATED(USBHS_TSTA2_OFFSET, "Using deprecated macro USBHS_TSTA2_OFFSET") (0x814) /**< (USBHS_TSTA2) General Test A2 Register Offset */
#define USBHS_TSTA2_RemovePUWhenTX_Msk DEPRECATED(USBHS_TSTA2_RemovePUWhenTX_Msk, "Using deprecated macro USBHS_TSTA2_RemovePUWhenTX_Msk") (_U_(0x1) << USBHS_TSTA2_RemovePUWhenTX_Pos) /**< (USBHS_TSTA2) Remove Pull-up When TX Mask */
#define USBHS_TSTA2_RemovePUWhenTX_Pos DEPRECATED(USBHS_TSTA2_RemovePUWhenTX_Pos, "Using deprecated macro USBHS_TSTA2_RemovePUWhenTX_Pos") 9 /**< (USBHS_TSTA2) Remove Pull-up When TX Position */
#define USBHS_TSTA2_RemovePUWhenTX DEPRECATED(USBHS_TSTA2_RemovePUWhenTX, "Using deprecated macro USBHS_TSTA2_RemovePUWhenTX") USBHS_TSTA2_RemovePUWhenTX_Msk /**< \deprecated Old style mask definition for 1 bit bitfield. Use USBHS_TSTA2_RemovePUWhenTX_Msk instead */
#define USBHS_VERSION_MASK DEPRECATED(USBHS_VERSION_MASK, "Using deprecated macro USBHS_VERSION_MASK") _U_(0xF0FFF) /**< \deprecated (USBHS_VERSION) Register MASK (Use USBHS_VERSION_Msk instead) */
#define USBHS_VERSION_MFN_Msk DEPRECATED(USBHS_VERSION_MFN_Msk, "Using deprecated macro USBHS_VERSION_MFN_Msk") (_U_(0xF) << USBHS_VERSION_MFN_Pos) /**< (USBHS_VERSION) Metal Fix Number Mask */
#define USBHS_VERSION_MFN_Pos DEPRECATED(USBHS_VERSION_MFN_Pos, "Using deprecated macro USBHS_VERSION_MFN_Pos") 16 /**< (USBHS_VERSION) Metal Fix Number Position */
#define USBHS_VERSION_MFN(value) DEPRECATED(USBHS_VERSION_MFN, "Using deprecated macro USBHS_VERSION_MFN") (USBHS_VERSION_MFN_Msk & ((value) << USBHS_VERSION_MFN_Pos))
#define USBHS_VERSION_Msk DEPRECATED(USBHS_VERSION_Msk, "Using deprecated macro USBHS_VERSION_Msk") _U_(0xF0FFF) /**< (USBHS_VERSION) Register Mask */
#define USBHS_VERSION_OFFSET DEPRECATED(USBHS_VERSION_OFFSET, "Using deprecated macro USBHS_VERSION_OFFSET") (0x818) /**< (USBHS_VERSION) General Version Register Offset */
#define USBHS_VERSION_VERSION_Msk DEPRECATED(USBHS_VERSION_VERSION_Msk, "Using deprecated macro USBHS_VERSION_VERSION_Msk") (_U_(0xFFF) << USBHS_VERSION_VERSION_Pos) /**< (USBHS_VERSION) Version Number Mask */
#define USBHS_VERSION_VERSION_Pos DEPRECATED(USBHS_VERSION_VERSION_Pos, "Using deprecated macro USBHS_VERSION_VERSION_Pos") 0 /**< (USBHS_VERSION) Version Number Position */
#define USBHS_VERSION_VERSION(value) DEPRECATED(USBHS_VERSION_VERSION, "Using deprecated macro USBHS_VERSION_VERSION") (USBHS_VERSION_VERSION_Msk & ((value) << USBHS_VERSION_VERSION_Pos))

#endif
